{
  "format": "layers-model",
  "generatedBy": "keras v2.10.0",
  "convertedBy": "TensorFlow.js Converter v4.0.0",
  "modelTopology": {
    "keras_version": "2.10.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "scoliosis_detection_model",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 34],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_1"
            },
            "name": "input_1",
            "inbound_nodes": []
          }
        ],
        "input_layers": [["input_1", 0, 0]],
        "output_layers": [
          ["classification_output", 0, 0],
          ["regression_output", 0, 0]
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": []
    }
  ]
} 